cases/VolumeAreaVerification/VolumeAreaVerification4/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
300000
(
-3.9996
-3.9996
-3.9996
-3.9996
-3.9996
-3.9996
-3.9996
-3.9996
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-3.9996
-3.9188
-3.838
-3.7572
-3.6764
-3.5956
-3.5148
-3.434
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
2000
(
-3.9996
-3.9188
-3.838
-3.7572
-3.6764
-3.5956
-3.5148
-3.434
...
)
;
    }
    boundaries
    {
        type            calculated;
        value           nonuniform List<scalar> 
36000
(
-4.04
-4.04
-4.04
-4.04
-4.04
-4.04
-4.04
-4.04
...
)
;
    }
}


// ************************************************************************* //
