cases/VolumeAreaVerification/VolumeAreaVerification4/constant/geometricCalcDict
FoamFile
{
    version    2.0;
    format    ascii;
    class    dictionary;
    location    "system";
    object    geometricCalcDict;
}
//*******************************************************//
zone0{e1 ( -1.000000e+00 0.000000e+00 0.000000e+00 ); e2 ( 0.000000e+00 1.000000e+00 0.000000e+00 );}

zone1{e1 ( -1.000000e+00 0.000000e+00 -1.000000e+00 ); e2 ( 0.000000e+00 1.000000e+00 0.000000e+00 );}

zone2{e1 ( 0.000000e+00 0.000000e+00 -1.000000e+00 ); e2 ( 0.000000e+00 1.000000e+00 0.000000e+00 );}
