cases/VolumeAreaVerification/VolumeAreaVerification4/system/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvOptions;
}porosityInzone0
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(1.176079e+01 3.447128e+00 3.447128e+00);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( -1.000000e+00 0.000000e+00 0.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone0;
	}
}
porosityInzone1
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(8.482458e+00 2.486238e+00 2.486238e+00);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( -1.000000e+00 0.000000e+00 -1.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone1;
	}
}
porosityInzone2
{
	active	true;
	type	explicitPorositySource;
	explicitPorositySourceCoeffs
	{
		type	DarcyForchheimer;
		DarcyForchheimerCoeffs
		{
			d	(0.0 0.0 0.0);
			f	(6.411060e+00 1.879104e+00 1.879104e+00);
			coordinateSystem
			{
				type	cartesian;
				origin	(0.0 0.0 0.0);
				coordinateRotation
				{
					type	axesRotation;
					e1	( 0.000000e+00 0.000000e+00 -1.000000e+00 );
					e2	( 0.000000e+00 1.000000e+00 0.000000e+00 );
				}
			}
			rho	rho;
			mu	mu;
		}
		selectionMode	cellZone;
		cellZone	zone2;
	}
}
