cases/VolumeAreaVerification/VolumeAreaVerification4/system/setFieldsDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	setFieldsDict;
}
defaultFieldValues	();
regions	();
