cases/VolumeAreaVerification/VolumeAreaVerification4/system/snappyHexMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	snappyHexMeshDict;
}
castellatedMesh	true;
snap	true;
addLayers	false;
geometry
{
	box_1.stl
	{
		type	triSurfaceMesh;
		simflowType	primitive;
		primitiveType	box;
		name	box_1;
		max	(0.25 0.25 0.25);
		min	(-0.25 -0.25 -0.25);
		faceGroups
		{
			x_min
			{
				name	box_1;
			}
			x_max
			{
				name	box_1;
			}
			y_min
			{
				name	box_1;
			}
			y_max
			{
				name	box_1;
			}
			z_min
			{
				name	box_1;
			}
			z_max
			{
				name	box_1;
			}
		}
	}
	simulationVolume.stl
	{
		type	triSurfaceMesh;
		simflowType	primitive;
		primitiveType	box;
		name	simulationVolume;
		max	(0.5 0.5 0.5);
		min	(-0.5 -0.5 -0.5);
		faceGroups
		{
			x_min
			{
				name	simulationVolume;
			}
			x_max
			{
				name	simulationVolume;
			}
			y_min
			{
				name	simulationVolume;
			}
			y_max
			{
				name	simulationVolume;
			}
			z_min
			{
				name	simulationVolume;
			}
			z_max
			{
				name	simulationVolume;
			}
		}
	}
}
castellatedMeshControls
{
	locationInMesh	(0.17 0.0 0.0);
	refinementSurfaces
	{
	}
	refinementRegions
	{
	}
	limitRegions
	{
	}
	features	
	(
	);
	maxLocalCells	1000000;
	maxGlobalCells	10000000;
	nCellsBetweenLevels	4;
	maxLoadUnbalance	0.1;
	minRefinementCells	10;
	resolveFeatureAngle	30.0;
	allowFreeStandingZoneFaces	true;
}
snapControls
{
	tolerance	1.0;
	nSmoothPatch	3;
	nSolveIter	500;
	nRelaxIter	5;
	nFeatureSnapIter	10;
	implicitFeatureSnap	true;
	explicitFeatureSnap	true;
	multiRegionFeatureSnap	true;
	nFaceSplitInterval	5;
}
addLayersControls
{
	layers
	{
	}
	relativeSizes	true;
	minThickness	0.1;
	firstLayerThickness	0.2;
	expansionRatio	1.25;
	nGrow	0;
	featureAngle	180.0;
	maxFaceThicknessRatio	0.5;
	nSmoothSurfaceNormals	5;
	nSmoothThickness	10;
	minMedialAxisAngle	90.0;
	maxThicknessToMedialRatio	0.5;
	nMedialAxisIter	100;
	nSmoothNormals	3;
	slipFeatureAngle	30.0;
	nRelaxIter	5;
	nBufferCellsNoExtrude	0;
	nLayerIter	50;
	nRelaxedIter	20;
	detectExtrusionIsland	true;
}
meshQualityControls
{
	maxNonOrtho	65.0;
	maxBoundarySkewness	20.0;
	maxInternalSkewness	4.0;
	maxConcave	80.0;
	minVol	1.0E-14;
	minTetQuality	1.0E-20;
	minArea	-1.0;
	minTwist	0.02;
	minTriangleTwist	-1.0;
	minDeterminant	0.01;
	minFaceWeight	0.05;
	minVolRatio	0.01;
	minVolCollapseRatio	0.1;
	nSmoothScale	4;
	errorReduction	0.75;
	relaxed
	{
		maxNonOrtho	75.0;
	}
}
mergeTolerance	1.0E-6;
debug	0;
