cases/VolumeAreaVerification/VolumeAreaVerification4/system/topoSetDict
FoamFile
{
    version    2.0;
    format    ascii;
    class    dictionary;
    location    "system";
    object    topoSetDict;
}
actions    (    {
        name    zone0;
        type    cellZoneSet;
        action    new;
        source    surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/STL_Files/0.stl";
            //useSurfaceOrientation    true;
            outsidePoints    ();
            includeInside    false;
            includeOutside    false;
            includeCut    true;
            nearDistance    -1.0;
            curvature    -100.0;
        }
    }    {
        name    zone1;
        type    cellZoneSet;
        action    new;
        source    surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/STL_Files/1.stl";
            //useSurfaceOrientation    true;
            outsidePoints    ();
            includeInside    false;
            includeOutside    false;
            includeCut    true;
            nearDistance    -1.0;
            curvature    -100.0;
        }
    }    {
        name    zone2;
        type    cellZoneSet;
        action    new;
        source    surfaceToCell;
        sourceInfo
        {
            file    "constant/triSurface/STL_Files/2.stl";
            //useSurfaceOrientation    true;
            outsidePoints    ();
            includeInside    false;
            includeOutside    false;
            includeCut    true;
            nearDistance    -1.0;
            curvature    -100.0;
        }
    });